app/Controllers/Gudang/BahanBakuController.php

SELECT *
FROM `bahan_baku`
WHERE `bahan_baku`.`id` = '3'
---
    public function editStok($id = null)
    {
        $bahan = $this->bahanBakuModel->find($id);