app/Controllers/Gudang/Dashboard.php

    public function index()
    {
        $bahanModel = new BahanBakuModel();
        $permintaanModel = new PermintaanModel();

        // Data untuk ditampilkan di dashboard Gudang
        $data['title'] = 'Dashboard Petugas Gudang';
        $data['total_bahan'] = $bahanModel->countAllResults();
        $data['permintaan_menunggu'] = $permintaanModel->where('status', 'menunggu')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `bahan_baku`
SELECT COUNT(*) AS `numrows`
FROM `permintaan`
WHERE `status` = 'menunggu'