app/Controllers/Admin.php

SELECT *
FROM `courses`
---
    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Akses ditolak!');
        }

        $courseModel = new CourseModel();
        $courses = $courseModel->findAll();