app/Controllers/Student.php

    public function index()
    {
        if (session()->get('role') !== 'student') {
            return redirect()->to('/login')->with('error', 'Akses ditolak!');
        }

        $courseModel = new CourseModel();
        $courses = $courseModel->findAll();
---
SELECT *
FROM `courses`

    public function enroll($courseId)
    {
        if (session()->get('role') !== 'student') {
            return redirect()->to('/login')->with('error', 'Akses ditolak!');
        }

        $enrollModel = new EnrollmentModel();
        $enrollModel->insert([
            'user_id' => session()->get('id'),
            'course_id' => $courseId
        ]);
---
INSERT INTO `enrollments` (`user_id`, `course_id`) VALUES ('1', '1')