app/Models/BahanBakuModel.php

SELECT *
FROM `bahan_baku`
---
    public function getAllBahanBaku()
    {
        $bahan_baku_list = $this->findAll();