app/Models/PermintaanModel.php

SELECT `permintaan`.*
FROM `permintaan`
WHERE `permintaan`.`pemohon_id` = 6
ORDER BY `permintaan`.`created_at` DESC
---
    public function getPermintaanWithPemohon($id = null)
    {
        $builder = $this->db->table($this->table)
                    ->select('permintaan.*, user.name as nama_pemohon')
                    ->join('user', 'user.id = permintaan.pemohon_id')
                    ->orderBy('permintaan.created_at', 'DESC');

        if ($id !== null) {
            // Jika ID ada, kembalikan array (satu baris)
            return $builder->where('permintaan.id', $id)->get()->getRowArray();