app/Models/UserModel.php

    public function getUserByEmail(string $email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'budi.gudang@mbg.id'
 LIMIT 1